app/views/pets/_form.html.erb

	<%= f.label :animal_id, "Tipo de Animal" %>
	<%= f.select :animal_id, Animal.pluck(:name, :id), class: "form-control" %>
---
SELECT "animals"."name", "animals"."id" FROM "animals"

	<%= f.label :owner_id, "Propietario" %>
	<%= f.select :owner_id, Owner.pluck(:name, :id), class: "form-control" %>
---
SELECT "owners"."name", "owners"."id" FROM "owners"