app/controllers/animals_controller.rb

SELECT "animals".* FROM "animals" ORDER BY "animals"."name" ASC
---
  def index
  	@animals = Animal.order(:name)

INSERT INTO "animals" ("breed", "created_at", "name", "updated_at") VALUES (?, ?, ?, ?)  [["breed", "Come Botones"], ["created_at", Tue, 15 Nov 2016 04:39:01 UTC +00:00], ["name", "Gato"], ["updated_at", Tue, 15 Nov 2016 04:39:01 UTC +00:00]]
---
  def create
  	@animal = Animal.new(animal_params)
  	if @animal.save

SELECT "animals".* FROM "animals" WHERE "animals"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
  	@animal = Animal.find(params[:id])

SELECT "animals".* FROM "animals" WHERE "animals"."id" = ? LIMIT 1  [["id", "2"]]
UPDATE "animals" SET "breed" = ?, "updated_at" = ? WHERE "animals"."id" = 2  [["breed", "Come Botones."], ["updated_at", Tue, 15 Nov 2016 04:48:07 UTC +00:00]]
---
  def update
  	@animal = Animal.find(params[:id])
  	if @animal.update_attributes(animal_params)

SELECT "animals".* FROM "animals" WHERE "animals"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "animals" WHERE "animals"."id" = ?  [["id", 1]]
---
  def destroy
  	@animal = Animal.find(params[:id])
  	@animal.destroy