app/controllers/appointments_controller.rb

  def new
  	@pet = Pet.find(params[:pet_id])
---
SELECT "pets".* FROM "pets" WHERE "pets"."id" = ? LIMIT 1  [["id", "1"]]

  def create
  	@pet = Pet.find(params[:pet_id])
  	@appointment = @pet.appointments.build(appointment_params)
  	@appointment.doctor = @current_user
    @doctor = @current_user
    if @appointment.save
---
SELECT "pets".* FROM "pets" WHERE "pets"."id" = ? LIMIT 1  [["id", "1"]]
INSERT INTO "appointments" ("amount", "created_at", "description", "doctor_id", "pet_id", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

  def show
    @pet = Pet.find(params[:pet_id])
    @appointment = Appointment.find(params[:id])
    @doctor = Doctor.find(@current_user.id)
---
SELECT "pets".* FROM "pets" WHERE "pets"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "appointments".* FROM "appointments" WHERE "appointments"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "doctors".* FROM "doctors" WHERE "doctors"."id" = ? LIMIT 1  [["id", 1]]

  def edit
    @pet = Pet.find(params[:pet_id])
    @appointment = Appointment.find(params[:id])
    @doctor = Doctor.find(@current_user.id)
---
SELECT "pets".* FROM "pets" WHERE "pets"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "appointments".* FROM "appointments" WHERE "appointments"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "doctors".* FROM "doctors" WHERE "doctors"."id" = ? LIMIT 1  [["id", 1]]

  def update
    @pet = Pet.find(params[:pet_id])
    @appointment = Appointment.find(params[:id])
    @doctor = Doctor.find(@current_user.id)
    if @appointment.update_attributes(appointment_params)
---
SELECT "pets".* FROM "pets" WHERE "pets"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "appointments".* FROM "appointments" WHERE "appointments"."id" = ? LIMIT 1  [["id", "2"]]
SELECT "doctors".* FROM "doctors" WHERE "doctors"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "appointments" SET "description" = ?, "updated_at" = ? WHERE "appointments"."id" = 2  [["description", "Se trago un boton... de nuevo :( \r\nedit: era el mismo boton"], ["updated_at", Mon, 14 Nov 2016 02:41:32 UTC +00:00]]