app/controllers/doctors_controller.rb

  def show
    @doctor = Doctor.find(@current_user.id)
---
SELECT "doctors".* FROM "doctors" WHERE "doctors"."id" = ? LIMIT 1  [["id", 1]]

	def create
	@doctor = Doctor.new(doctor_params)
  	if @doctor.save
---
INSERT INTO "doctors" ("created_at", "email", "name", "password_digest", "updated_at") VALUES (?, ?, ?, ?, ?)

  def edit
    @doctor = Doctor.find(@current_user.id)
---
SELECT "doctors".* FROM "doctors" WHERE "doctors"."id" = ? LIMIT 1  [["id", 1]]

  def update
    @doctor = Doctor.find(@current_user.id)

    if @doctor.update_attributes(doctor_params)
---
SELECT "doctors".* FROM "doctors" WHERE "doctors"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "doctors" SET "password_digest" = ?, "updated_at" = ? WHERE "doctors"."id" = 1  [["password_digest", "$2a$10$W/oqjfxg6GWMe0ISAsG9Des0ZGEIy0AG/VmG.cUTiz1hGS1XODsY2"], ["updated_at", Mon, 12 Dec 2016 03:40:02 UTC +00:00]]