app/controllers/owners_controller.rb

  def index
  	@owners = Owner.order(:id)
---
SELECT "owners".* FROM "owners" ORDER BY "owners"."id" ASC

  def pets
    @owner = Owner.find(params[:id])
---
SELECT "owners".* FROM "owners" WHERE "owners"."id" = ? LIMIT 1  [["id", "1"]]

  def show
  	@owner = Owner.find(params[:id])
---
SELECT "owners".* FROM "owners" WHERE "owners"."id" = ? LIMIT 1  [["id", "1"]]

  def create
  	@owner = Owner.new(owner_params)
  	if @owner.save
---
INSERT INTO "owners" ("address", "created_at", "email", "last_name", "name", "phone", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def edit
  	@owner = Owner.find(params[:id])
---
SELECT "owners".* FROM "owners" WHERE "owners"."id" = ? LIMIT 1  [["id", "1"]]

  def update
  	@owner = Owner.find(params[:id])

  	if @owner.update_attributes(owner_params)
---
SELECT "owners".* FROM "owners" WHERE "owners"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "owners" SET "last_name" = ?, "updated_at" = ? WHERE "owners"."id" = 3  [["last_name", "Pacheco"], ["updated_at", Mon, 05 Dec 2016 03:39:07 UTC +00:00]]

  def destroy
  	@owner = Owner.find(params[:id])
  	@owner.destroy
---
SELECT "owners".* FROM "owners" WHERE "owners"."id" = ? LIMIT 1  [["id", "2"]]
DELETE FROM "owners" WHERE "owners"."id" = ?  [["id", 2]]