app/controllers/pets_controller.rb

  def index
  	@pets = Pet.order(:name)
---
SELECT "pets".* FROM "pets" ORDER BY "pets"."name" ASC

  def create
  	@pet = Pet.new(pet_params)
  	if @pet.save
---
INSERT INTO "pets" ("animal_id", "born_at", "created_at", "name", "observations", "pet_url", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def edit
  	@pet = Pet.find(params[:id])
---
SELECT "pets".* FROM "pets" WHERE "pets"."id" = ? LIMIT 1  [["id", "1"]]

  def update
  	@pet = Pet.find(params[:id])
  	if @pet.update_attributes(pet_params)
---
SELECT "pets".* FROM "pets" WHERE "pets"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "pets" SET "born_at" = ?, "updated_at" = ?, "pet_url" = ? WHERE "pets"."id" = 3  [["born_at", nil], ["updated_at", Tue, 13 Dec 2016 04:01:09 UTC +00:00], ["pet_url", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Pou.png/220px-Pou.png"]]

  def destroy
  	@pet = Pet.find(params[:id])
  	@pet.destroy
---
SELECT "pets".* FROM "pets" WHERE "pets"."id" = ? LIMIT 1  [["id", "2"]]
DELETE FROM "pets" WHERE "pets"."id" = ?  [["id", 2]]