app/controllers/sessions_controller.rb

  def create
  	email = params[:session][:email]
  	password = params[:session][:password]

  	@doctor = Doctor.find_by_email(email)
---
SELECT "doctors".* FROM "doctors" WHERE "doctors"."email" = 'kevin@kevin.com' LIMIT 1